---
layout: post
tags: [network] # add tag
img: internet.jpg
---

# 交换机

```
显示 MAC 地址表: Switch#show mac address-table

清理MAC地址表: Switch#clear mac address-table dynamic

查看MAC地址表老化时间: Switch#show mac address-table aging-time  

查看接口详细信息: Switch#show interfaces ethernet 0/0   

查看接口状态: Switch#show ip interface brief
```

# 设备预配置

```
enable
configure terminal
line console 0
no exec-timeout
logging synchronous 
no ip domain lookup
hostname

命令解释如下

用户模式下输入：enable    	进入特权模式

特权模式下输入：configure terminal  进入全局模式

全局模式下输入：line console 0 	进入线路模式

线路模式下输入：no exec-timeout 关闭登录超时登出

线路模式下输入：logging synchronous 关闭日志打断命令

全局模式下输入：no ip domain lookup 关闭设备域名解析功能   （避免输入错误信息后等待！）

全局模式下输入：hostname 		修改设备名字 
```

# 设备的三种模式

```
以交换机举例：
Router> 用户模式

Router# 特权模式

Router(config)# 全局模式
```

# 设备通用命令

```
修改名字: Router(config)#hostname PC

路由器模拟PC机，关闭路由功能: PC(config)#no ip routing 
  
进入到接口下: PC(config)#interface ethernet 0/3

配置IP地址: PC(config-if)#ip address 12.1.1.2 255.255.255.0

开启接口: PC(config-if)#no shutdown 

show命令在其他模式下需要加 do: PC(config-if)#do show ip interface brief  

PC机网关配置: PC(config)#ip default-gateway 12.1.1.1

保存配置: PC#copy running-config startup-config
或者：PC#write 

查看接口下的配置: PC1#show run interface ethernet 0/3

筛选查找的信息:
PC1#show run | section line con 0
r1#show int e0/0 | include Ha

查看接口信息： 
show ip interface brief


在特权模式下输入，作用是查看设备下次启动时的配置:
show startup-config 

直接到特权模式：
ctrl+z 
直接到光标的最左端：
ctrl+a 
直接到光变的最右端：
ctrl+e 
删除整行命令：
ctrl+u 
删除一个单词：
ctrl+w  
```

# 配置 Telnet 远程登录

```
进入线路模式：
r1(config)#line vty 0 4
设置密码r1(config-line)#password 456
开启登陆r1(config-line)#login
开启 telnet 远程登录r1(config-line)#transport input telnet 
设置进入特权模式下的密码
r1(config)#enable password 123
```

# Ping 命令

```
R1#ping 10.0.12.2 source 1.1.1.1 指定源地址 

R1#ping 10.0.12.3 timeout 0 指定超时时间，单位是秒 

R1#ping 10.0.12.2 repeat 1000 指定ping包的数量      

结束ping快捷键ctrl+shift+6

R1#ping 10.0.12.2 size 1000 指定数据包的大小

终止ping命令：ctrl+shift+6
```

# CDP 协议

思科设备默认开启 CDP 协议，用于网络排错和维护。在丢失拓扑图的情况下，用于重绘拓扑图

```
查看全部信息：特权模式输入show cdp entry *
看邻居地址：特权模式输入show cdp entry * protocol 
查看邻居：   特权模式输入show cdp neighbors
查看流量发送情况 ：特权模式输入show cdp traffic 
查看接口情况：特权模式输入show cdp interface e0/0
开启cdp功能：全局模式输入cdp run
接口下开启cdp功能：接口模式cdp enable
关闭设cdp功能：   全局模式输入no cdp run   
接口下关闭cdp功能： 接口模式no cdp enable 

注意：如果全局模式下关闭了cdp功能，即使接口开启了cdp功能也没有用

修改发送报文时间：     全局模式输入cdp  timer 
修改邻居保持时间：     全局模式输入cdp  holdtime 
修改发送的版本号  ：   全局模式输入no  cdp  advertise-v2     
默认是版本2，修改为1
发送报文时间间隔要小于邻居保持时间间隔

CDP：60秒，180秒
LLDP：30秒，120秒
```


